# StairSet2D3DCompType

## Description
Sets 2D3D components type of stair - not recommended for use

```pascal
FUNCTION StairSet2D3DCompType(
				stair             : HANDLE;
				ComponentType2D3D : INTEGER) : BOOLEAN;
```

```python

def vs.StairSet2D3DCompType(stair, ComponentType2D3D):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||
|ComponentType2D3D|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs